In [16]:
import datetime
import requests
import pandas as pd
from io import StringIO
import pandas
pd.set_option('display.expand_frame_repr', False)  # 別折行

res = requests.get(
    "https://github.com/pandas-dev/pandas/blob/master/doc/data/titanic.csv")
dfs = pd.read_html(StringIO(res.text))
titanic = dfs[0]
titanic.head(10)

   Unnamed: 0  PassengerId  Survived  Pclass                                               Name     Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0         NaN            1         0       3                            Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500   NaN        S
1         NaN            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1      0          PC 17599  71.2833   C85        C
2         NaN            3         1       3                             Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
3         NaN            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0            113803  53.1000  C123        S
4         NaN            5         0       3                           Allen, Mr. William Henry    male  35.0      0      0            373450   8.0500   NaN        S
5         NaN            6         0       3                                   Moran, Mr. James    male   NaN      0      0            330877   8.4583   NaN        Q
6         NaN            7         0       1                            McCarthy, Mr. Timothy J    male  54.0      0      0             17463  51.8625   E46        S
7         NaN            8         0       3                     Palsson, Master. Gosta Leonard    male   2.0      3      1            349909  21.0750   NaN        S
8         NaN            9         1       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0      2            347742  11.1333   NaN        S
9         NaN           10         1       2                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1      0            237736  30.0708   NaN        C

### 將所有乘客姓名全部改為小寫

In [17]:
pd.set_option('display.expand_frame_repr', False)  # 別折行
titanic["Name"].str.lower()

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [18]:
titanic["Name"].str.split(",")

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: Name, Length: 891, dtype: object

### 類似序列中的datetime物件有dt存取子的道理相同，string方法內也有str存取子，
這些方法提供element-wise ，也就是不用透過for-loop就可以運算每個欄位的資料。

In [20]:
# Similar to datetime objects in the time series tutorial having a dt accessor, a number of specialized string methods are available when using the str accessor. 
# These methods have in general matching names with the equivalent built-in string methods for single elements, 
# but are applied element-wise (remember element-wise calculations?) on each of the values of the columns.
titanic["Surname"] = titanic["Name"].str.split(",").str.get(0)   
titanic["Surname"]

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Surname, Length: 891, dtype: object

In [29]:
titanic["Name"].str.contains("Countess")                # 找出旅客姓名中包含"Countess" ,會回傳 True|False
titanic[titanic["Name"].str.contains("Countess")]       # 將結果再丟到[]的子查詢中，找出是哪一筆。
titanic["Name"].str.len()                               # 找出姓名的字元數 
titanic["Name"].str.len() >30                           # 找出姓名的字元數大於30個字 ,會回傳 True|False
titanic[titanic["Name"].str.len()>30]                   # 找出姓名的字元數，有哪些人?
titanic["Name"].str.len().idxmax()                      # 哪個字元樹是最多的? 回傳id號碼                  
titanic.loc[titanic["Name"].str.len().idxmax(),"Name"]  # 套入到loc[]查詢

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'

### 將性別的Sex male改為M，femile改為"F"...replace

In [32]:
titanic
titanic["Sex_short"] = titanic["Sex"].replace({"male": "M", "female": "F"})
titanic["Sex_short"]

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: Sex_short, Length: 891, dtype: object